---
kind: other
id: Methods.T:Autodesk.Revit.DB.IGetLocalPathForOpenCallback
source: html/b54b4ca7-7df8-cd8c-ecd6-44864a5b7796.htm
---
# IGetLocalPathForOpenCallback Methods

Implement this method to specify the local path from where a copy of a Revit link external resource can be opened
 for modification without interfering with its use as a link in other open documents.